const testExample = [
  'aaaaaa00000!',
  'aaaaaa00000@',
  'aaaaaa00000#',
  'aaaaaa00000$',
  'aaaaaaaa12',
  'a@1',
  'a@1a@1a@1a@1',
  '@qqqqqq11111',
  '@想11111111',
  '123123123d@想',
  'a@1a@1a@1a@1000000000000',
];

// const reg = /(?!^([0-9]+|[a-zA-Z]+|[$!@#$%^&*()_+,./<>?[\]{}\\]+)$)^[a-zA-Z0-9$!@#$%^&*()_+,./<>?[\]{}\\]{8,20}$/;
/* 包含数字、字母、一堆特殊符号 */
// const reg = /^(?=.*?[a-zA-Z])(?=.*?[0-9])(?=.*?[$!@#$%^&*()_+,./<>?[\]{}\\]).{8,20}$/;
/* 排除其他 */
const reg = /^(?=.*?[a-z])(?=.*?[A-Z])(?=.*?[0-9])(?=.*?[$!@#$%^&*()_+,./<>?[\]{}\\])[a-zA-Z0-9$!@#$%^&*()_+,./<>?[\]{}\\]{8,20}$/;

for (let i = 0; i < testExample.length; i++) {
  const example = testExample[i];
  console.log(example, reg.test(example));
}
